BG2BKK/nordic_nrf51822_demo/sdk11/examples/ble_peripheral/ble_app_oled_traditional/main.c
void user_oled_init() {
	ssd1306_init_i2c(SSD1306_CONFIG_SCL_PIN, SSD1306_CONFIG_SDA_PIN);
	ssd1306_begin(SSD1306_SWITCHCAPVCC, SSD1306_I2C_ADDRESS, false);
	nrf_delay_ms(1);
	ssd1306_clear_display();
	ssd1306_display();
	nrf_delay_ms(1);
}

void user_adc_init() {
	adc_config();
}

void app_user_handler(void *p_context) {
	static bool ble_blink = true;

	user_start_adc();

	ssd1306_clear_display();

	if(user_app_config.is_connected) {
		drawble(80, 0);
	} else if (user_app_config.is_advertising ) {
		if(ble_blink) {
			drawble(80, 0);
			ble_blink = false;
		} else {
			ble_blink = true;
		}
	}

	ssd1306_draw_char(100, 0, user_app_config.oled_data, 1, 0, 2);

	uint16_t adc_sample= user_get_adc();
	if(adc_sample > 999)
		adc_sample = 999;
	else if(adc_sample < 1)
		adc_sample = 0;
	uint8_t c1 = adc_sample / 100 + '0';
	uint8_t c2 = adc_sample / 10 % 10 + '0'; 
	uint8_t c3 = adc_sample % 10 + '0';

	ssd1306_draw_char(12, 24, c1, 1, 0, 5);
	ssd1306_draw_char(52, 24, c2, 1, 0, 5);
	ssd1306_draw_char(92, 24, c3, 1, 0, 5);

	ssd1306_display();
	nrf_delay_ms(0);

	printf("battery: %d\n", adc_sample);

	uint16_t len = sizeof(adc_sample);
	user_ble_battery_notification(&m_nus, &adc_sample, &len);
}

void user_app_init() {

	uart_init();
	user_oled_init();
	user_adc_init();

	memset(&user_app_config, 0, sizeof(user_app_config_t));
	printf("%s", START_STRING);

	APP_TIMER_DEF(user_app_timer);
	app_timer_create(&user_app_timer, APP_TIMER_MODE_REPEATED, app_user_handler);
	app_timer_start(user_app_timer,  APP_TIMER_TICKS(1000, 0), NULL);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    
 //   buttons_leds_init(&erase_bonds);
	user_app_init();

    ble_stack_init();
    gap_params_init();
    services_init();
	device_manager_init(erase_bonds);
    advertising_init();
    conn_params_init();

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	user_app_config.is_advertising = true;

    
    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}
